---
kind: other
id: Methods.T:Autodesk.Revit.UI.IControllableDropHandler
source: html/720f7856-e026-ba2e-738d-59e7c107b66b.htm
---
# IControllableDropHandler Methods

Implement this method to inform Revit whether the drop event can be executed onto the given view.